{"question": "Welcome to TextWorld! First of all, you could, like, retrieve the key from the floor of the cellar. Once you have taken the key, unlock the safe. Then, open the safe. And then, recover the latchkey from the safe. After that, assure that the locker is locked with the latchkey. Once that's all handled, you can stop!", "idx": 0}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! Here is your task for today. First stop, go to the south. And then, head east. With that over with, make an effort to go north. With that accomplished, ensure that the type D locker is open. Then, take the keyboard from the type D locker. That's it!", "idx": 1}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, if it's not too much trouble, I need you to pick up the key from the box. Then, check that the hatch is unlocked with the key. Then, assure that the hatch is wide open. And then, take a trip east. And then, pick up the laptop from the bench. That's it!", "idx": 2}
{"question": "Welcome to another fast paced episode of TextWorld! Here is your task for today. First step, attempt to travel north. With that accomplished, try to head north. Then, retrieve the fresh laundry scented key from the locker. After that, attempt to head east. After that, unlock the fresh laundry scented chest. Alright, thanks!", "idx": 3}
{"question": "I hope you're ready to go into rooms and interact with objects, because you've just entered TextWorld! Here is your task for today. First, it would be a great idea if you could attempt to go to the west. Then, recover the stick of butter from the portmanteau within the parlor. After that, eat the stick of butter. Once that's all handled, you can stop!", "idx": 4}
{"question": "Welcome to TextWorld! Here is how to play! First off, if it's not too much trouble, I need you to check that the portal is unlocked with the passkey. Once you have unlocked the portal, ensure that the portal in the kitchenette is open. And then, make an attempt to go east. After that, recover the mouse from the floor of the study. Then, you can place the mouse inside the display inside the study. Alright, thanks!", "idx": 5}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First thing I need you to do is to travel east. With that over with, attempt to go south. With that done, attempt to venture west. If you can succeed at that, pick up the sponge from the bench in the sauna. After stealing the sponge, you can deposit the sponge into the chest in the sauna. Alright, thanks!", "idx": 6}
{"question": "Welcome to TextWorld! Here is your task for today. First of all, you could, like, move north. After that, make an effort to go to the east. Then, try to head south. After that, recover the nest of ticks from the floor of the dish-pit. Then, sit the nest of ticks on the shelf. Alright, thanks!", "idx": 7}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, if it's not too much trouble, I need you to make an effort to go to the south. Next, pick up the key from the floor of the cubicle. With the key, make absolutely sure that the box is unlocked with the key. And then, make it so that the box is wide open. Then, take the printer from the box. Once that's all handled, you can stop!", "idx": 8}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, recover the passkey from the safe. And then, unlock the box within the basement. Then, make sure that the box is opened. And then, retrieve the fly larva from the box within the basement. If you can get your hands on the fly larva, deposit the fly larva on the floor of the basement. And once you've done that, you win!", "idx": 9}
{"question": "It's time to explore the amazing world of TextWorld! Here is how to play! First off, head south. Following that, attempt to take a trip east. Then, attempt to go north. With that over with, pick-up the fly larva from the floor of the attic. After that, deposit the fly larva inside the toolbox. Alright, thanks!", "idx": 10}
{"question": "It's time to explore the amazing world of TextWorld! Here is how to play! First of all, venture east. And then, ensure that the passageway is open. And then, go to the north. Then, take a trip east. If you can get through with that, look and see that the chest is closed. Alright, thanks!", "idx": 11}
{"question": "Welcome to another exciting episode of TextWorld! First off, if it's not too much trouble, I need you to recover the keycard from the display. Then, insert the keycard into the locker's lock to unlock it. And then, make it so that the locker is open. And then, retrieve the fondue from the locker inside the vault. After that, eat the fondue. Got that? Good!", "idx": 12}
{"question": "You are now playing a exciting round of TextWorld! First of all, make an effort to head east. With that done, travel east. And then, recover the butterfly from the floor of the canteen. And then, venture west. Then, place the butterfly inside the cabinet. That's it!", "idx": 13}
{"question": "You are now playing a exciting session of TextWorld! First, it would be a great idea if you could attempt to venture west. Okay, and then, move west. That done, retrieve the staple from the chair inside the office. Once you have got the staple, head east. Then, rest the staple on the shelf inside the cellar. Alright, thanks!", "idx": 14}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First of all, you could, like, travel south. Then, move west. And then, take the Comic Strip Calendar from the locker within the workshop. And then, try to travel east. And then, place the Comic Strip Calendar on the floor of the shower. That's it!", "idx": 15}
{"question": "You are now playing a profound round of TextWorld! First of all, you could, like, make an attempt to go west. And then, move south. After that, attempt to head east. And then, take the Henderson's limited edition keycard from the counter. After you have taken the Henderson's limited edition keycard, check that the Henderson's limited edition chest inside the steam room is unlocked with the Henderson's limited edition keycard. Alright, thanks!", "idx": 16}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First, it would be great if you could head west. Then, assure that the chest is unlocked with the latchkey. And then, assure that the chest is opened. If you have opened the chest, take the formless keycard from the chest inside the bar. And then, look and see that the formless portal is locked. Got that? Good!", "idx": 17}
{"question": "I hope you're ready to go into rooms and interact with objects, because you've just entered TextWorld! Here is your task for today. First of all, you could, like, take the TextWorld key from the toolbox in the studio. After that, unlock the TextWorld box inside the studio. Then, ensure that the TextWorld box is open. Then, recover the Henderson's style latchkey from the TextWorld box. Then, check that the Henderson's style chest is unlocked with the Henderson's style latchkey. That's it!", "idx": 18}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First, it would be good if you could make sure that the American hatch in the basement is unlocked. Then, ensure that the American hatch is open. Then, try to go south. And then, move east. After that, make sure that the TextWorld limited edition box inside the laundry place is wide open. And if you do that, you're the winner!", "idx": 19}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! Here is how to play! First, it would be a great idea if you could make absolutely sure that the cuboid box in the garage is opened. Then, retrieve the keycard from the cuboid box within the garage. And then, check that the box inside the garage is unlocked with the keycard. After that, doublecheck that the box within the garage is wide open. Then, retrieve the fly larva from the box in the garage. Got that? Good!", "idx": 20}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! First off, if it's not too much trouble, I need you to go to the east. Then, try to venture north. And then, pick up the Henderson's keycard from the workbench in the closet. After that, head south. And then, lock the Henderson's chest with the Henderson's keycard. Got that? Good!", "idx": 21}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First of all, make an attempt to go north. Then, move north. And then, pick-up the fondue from the floor of the scullery. After that, eat the fondue. Got that? Good!", "idx": 22}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! Here is your task for today. Your first objective is to open the safe within the cookery. And then, move south. Then, recover the sponge from the floor of the sauna. If you can get your hands on the sponge, attempt to take a trip north. And then, insert the sponge into the safe within the cookery. Once that's all handled, you can stop!", "idx": 23}
{"question": "Who's got a virtual machine and is about to play through an exciting round of TextWorld? You do! Here is how to play! First of all, make an effort to travel north. And then, go to the east. And then, retrieve the sponge from the floor of the washroom. And then, go south. Next, place the sponge on the floor of the study. That's it!", "idx": 24}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, if it's not too much trouble, I need you to make an effort to take a trip west. After that, go north. That done, move east. And then, take the American limited edition keycard from the bookshelf. After that, make it so the American limited edition safe is locked. That's it!", "idx": 25}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! First, it would be good if you could go west. Then, pick up the type 6 keycard from the rack within the cellar. After that, head east. After that, look and see that the type 6 chest within the attic is unlocked with the type 6 keycard. And then, open the type 6 chest inside the attic. That's it!", "idx": 26}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, if it's not too much trouble, I need you to retrieve the American passkey from the plate inside the canteen. Then, check that the American safe is unlocked with the American passkey. Then, ensure that the American safe in the canteen is open. After that, pick up the teacup from the American safe. And then, rest the teacup on the plate. That's it!", "idx": 27}
{"question": "It's time to explore the amazing world of TextWorld! Here is how to play! First stop, take a trip east. Then, look and see that the Microsoft limited edition chest is opened. Having opened the Microsoft limited edition chest, take the keycard from the Microsoft limited edition chest within the bedroom. And then, make it so that the chest in the bedroom is unlocked with the keycard. After unlocking the chest, make absolutely sure that the chest in the bedroom is ajar. That's it!", "idx": 28}
{"question": "Who's got a virtual machine and is about to play through an profound round of TextWorld? You do! Here is your task for today. First step, unlock the gate. And then, doublecheck that the gate is wide open. And then, head east. Then, retrieve the butterfly from the floor of the scullery. And then, rest the butterfly on the bowl. Once that's all handled, you can stop!", "idx": 29}
{"question": "It's time to explore the amazing world of TextWorld! Here is how to play! First of all, go east. After that, attempt to travel south. After that, pick up the key from the floor of the cookery. After that, make an attempt to go north. Then, check that the box within the bedchamber is unlocked with the key. Once that's all handled, you can stop!", "idx": 30}
{"question": "Welcome to TextWorld! Here is how to play! Your first objective is to close the box in the cookhouse. And then, go west. That done, lift the latchkey from the floor of the sauna. After that, go to the east. Then, Deposit the latchkey into the box inside the cookhouse to lock it. And once you've done that, you win!", "idx": 31}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, open the locker inside the workshop. After that, take the latchkey from the locker. And then, unlock the box with the latchkey. After that, ensure that the box in the workshop is open. Then, pick up the folder from the box in the workshop. Alright, thanks!", "idx": 32}
{"question": "It's time to explore the amazing world of TextWorld! Here is how to play! First of all, you could, like, take the formless keycard from the dresser. After that, make an attempt to go to the south. If you can get around to doing that, make sure that the formless box inside the cubicle is unlocked with the formless keycard. Then, make sure that the formless box is ajar. Then, recover the Advent Calendar from the formless box. That's it!", "idx": 33}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First off, retrieve the American key from the table. After that, check that the American chest in the pantry is unlocked with the American key. After that, open the American chest. Then, pick up the golf club from the American chest. And then, sit the golf club on the shelf inside the pantry. Got that? Good!", "idx": 34}
{"question": "You are now playing a profound game of TextWorld! Here is your task for today. First off, recover the passkey from the safe. And then, make absolutely sure that the box in the laundry place is unlocked with the passkey. And then, open the box. And then, pick up the Henderson's key from the box within the laundry place. After that, unlock the Henderson's safe within the laundry place with the Henderson's key. Got that? Good!", "idx": 35}
{"question": "Welcome to another life changing session of TextWorld! First stop, pick-up the non-euclidean passkey from the floor of the spare room. And then, make absolutely sure that the non-euclidean door is unlocked. And then, ensure that the non-euclidean door is open. And then, go to the south. That done, pick-up the coffee cup from the floor of the kitchen. And if you do that, you're the winner!", "idx": 36}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First, it would be a great idea if you could travel north. With that accomplished, pick up the non-euclidean key from the mantelpiece within the workshop. Then, go east. And then, go south. With that done, lock the non-euclidean chest in the canteen. Once that's all handled, you can stop!", "idx": 37}
{"question": "You are now playing a profound session of TextWorld! Here is how to play! First step, lift the cuboid keycard from the floor of the dish-pit. After stealing the cuboid keycard, check that the cuboid chest inside the dish-pit is unlocked with the cuboid keycard. And then, assure that the cuboid chest is opened. And then, recover the Microsoft latchkey from the cuboid chest. Then, lock the Microsoft chest inside the dish-pit. That's it!", "idx": 38}
{"question": "Who's got a virtual machine and is about to play through an fast paced round of TextWorld? You do! Here is your task for today. Your first objective is to make it so that the door within the restroom is open. Then, attempt to go to the north. Then, go to the east. Okay, and then, recover the type F key from the chair in the kitchenette. If you can get your hands on the type F key, unlock the type F locker with the type F key. Alright, thanks!", "idx": 39}
{"question": "Who's got a virtual machine and is about to play through an fast paced round of TextWorld? You do! Here is your task for today. First of all, you could, like, take the latchkey from the display in the spare room. Then, unlock the safe in the spare room. After that, doublecheck that the safe within the spare room is wide open. And then, recover the butterfly from the safe. After that, rest the butterfly on the shelf. That's it!", "idx": 40}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! Here is how to play! First of all, you could, like, look and see that the door within the scullery is wide open. Then, head east. Then, recover the worm from the suitcase. Then, attempt to move west. Okay, and then, throw the worm on the floor of the scullery. Alright, thanks!", "idx": 41}
{"question": "It's time to explore the amazing world of TextWorld! First off, go north. Okay, and then, open the chest. After that, pick up the fudge scented keycard from the chest. After getting the fudge scented keycard, venture south. And then, unlock the fudge scented safe within the restroom. And if you do that, you're the winner!", "idx": 42}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First of all, attempt to go to the west. Next, go west. Next, try to travel north. Then, attempt to go to the east. Then, take the pencil from the safe. And once you've done that, you win!", "idx": 43}
{"question": "Welcome to another fast paced game of TextWorld! Here is your task for today. Your first objective is to move west. Then, move west. Following that, take the mat from the bench. And then, make an effort to move east. And then, drop the mat on the floor of the cubicle. And if you do that, you're the winner!", "idx": 44}
{"question": "Hey, thanks for coming over to the TextWorld today, there is something I need you to do for me. First of all, head east. And then, assure that the gateway within the pantry is unlocked. After unlocking the gateway, ensure that the gateway in the pantry is open. If you have pulled open the gateway, go north. And then, take the broom from the toolbox inside the attic. Got that? Good!", "idx": 45}
{"question": "Get ready to pick stuff up and put it in places, because you've just entered TextWorld! Here is your task for today. First step, make an effort to travel south. After that, doublecheck that the type J passageway inside the shower is unlocked. Then, ensure that the type J passageway is open. Then, make an effort to head east. And then, pick-up the knife from the floor of the cookery. Alright, thanks!", "idx": 46}
{"question": "Welcome to TextWorld! First thing I need you to do is to recover the non-euclidean passkey from the floor of the study. Then, assure that the non-euclidean box is unlocked with the non-euclidean passkey. And then, open the non-euclidean box. And then, recover the American latchkey from the non-euclidean box in the study. And then, make absolutely sure that the American locker inside the study is locked with the American latchkey. And if you do that, you're the winner!", "idx": 47}
{"question": "Who's got a virtual machine and is about to play through an profound round of TextWorld? You do! Here is how to play! First off, make an effort to venture west. And then, make an effort to head west. And then, take the sandwich from the workbench in the spare room. And then, eat the sandwich. That's it!", "idx": 48}
{"question": "Welcome to another life changing game of TextWorld! First off, if it's not too much trouble, I need you to take a trip south. And then, make an effort to move south. If you can succeed at that, take the gummy bear from the table. After that, eat the gummy bear. And once you've done that, you win!", "idx": 49}
